micropython/micropython/ports/stm32/boards/NUCLEO_H753ZI/mpconfigboard.h
#include "boards/NUCLEO_H743ZI2/mpconfigboard.h"

#undef MICROPY_HW_BOARD_NAME
#define MICROPY_HW_BOARD_NAME       "NUCLEO_H753ZI"

#undef MICROPY_HW_MCU_NAME
#define MICROPY_HW_MCU_NAME         "STM32H753"
